[
  {
    "title": "Computer forensics: System forensics",
    "gen_list": [
      "Computer Forensics: A Guide for Law Enforcement",
      "System Forensics: A Framework for Investigating Computer Crimes",
      "Digital Forensics and Computing: An Introduction to the Field of Computer Forensics",
      "Computer Forensic Analysis: A Comprehensive Guide",
      "System Forensics: Techniques for Identifying and Analyzing Computer Systems"
    ]
  },
  {
    "title": "Architectures: Distributed architectures",
    "gen_list": [
      "Distributed Computing Systems",
      "Cloud Computing: A Distributed Systems Approach",
      "Federated Learning for Distributed Machine Learning",
      "Blockchain-Based Distributed Systems",
      "Distributed Artificial Intelligence: A Survey"
    ]
  },
  {
    "title": "Continuous mathematics: Topology",
    "gen_list": [
      "Topology: A First Course",
      "Introduction to Topology",
      "Continuous Mathematics: An Introduction",
      "Topology and Geometry",
      "A First Course in Topology"
    ]
  },
  {
    "title": "Computational complexity and cryptography: Cryptographic protocols",
    "gen_list": [
      "\"Cryptographic Protocols\" by A. Youssef",
      "\"Computational Complexity and Cryptography\" by A. Shoup",
      "\"Cryptography Engineering\" by N. Katz and V. Shmatikov",
      "\"Advances in Computational Cryptography\" edited by D. Pointcheval and E. Schrödl",
      "\"Computational Complexity and Cryptography: 10th Anniversary Edition\" edited by S. A. Vanstone"
    ]
  },
  {
    "title": "Software organization and properties: Contextual software domains",
    "gen_list": [
      "Contextual Software Domains: A Framework for Understanding Software Organization and Properties",
      "Software Organization and Properties in Contextual Domains",
      "Understanding Software Organization and Properties Through Contextual Domains",
      "The Impact of Contextual Domains on Software Organization and Properties",
      "Exploring the Relationship Between Software Organization, Properties, and Contextual Domains"
    ]
  },
  {
    "title": "Hardware validation: Physical verification",
    "gen_list": [
      "\"Physical Verification of VLSI Circuits\" by A. K. Nandi and S. C. Dash",
      "\"Hardware Validation: A Comprehensive Review\" by S. J. Lee and H. K. Kim",
      "\"Verification of Digital Circuits\" by M. T. Mehregani and A. R. Ghanbarzadeh",
      "\"Physical Verification of System-on-Chip Designs\" by Y. C. Huang and C. L. Liu",
      "\"Hardware Validation: Physical Verification Techniques and Tools\" by S. K. Singh and P. K. Gupta"
    ]
  },
  {
    "title": "Operations research: Forecasting",
    "gen_list": [
      "\"Forecasting Methods for Business and Economic Planning\" by John L. Taylor",
      "\"Advances in Forecasting: Theory, Methods, and Applications\" edited by P. R. H. Cheng and J. A. D. M. T. Smith",
      "\"Forecasting: A Handbook for the Healthcare Professional\" by Mark E. F. Warnken",
      "\"Operations Research in Forecasting: A Survey of Recent Developments\" by M. A. Shapiro and J. D. Crawford",
      "\"Forecasting for Business and Finance: A Guide to Techniques, Models, and Applications\" by David F. Hardy"
    ]
  },
  {
    "title": "Symbolic and algebraic manipulation: Symbolic and algebraic algorithms",
    "gen_list": [
      "A Survey of Symbolic and Algebraic Manipulation Techniques",
      "Symbolic and Algebraic Methods for Solving Diophantine Equations",
      "Algebraic Manipulation of Symbolic Expressions: A Survey",
      "Symbolic and Algebraic Computation in Mathematics and Computer Science",
      "Handbook of Symbolic and Algebraic Manipulation"
    ]
  },
  {
    "title": "Power and energy: Power estimation and optimization",
    "gen_list": [
      "A Survey on Power Estimation and Optimization Techniques in Wireless Sensor Networks",
      "Power Management for Wireless Sensor Networks: A Survey",
      "Energy-Efficient Communication Protocols for Wireless Sensor Networks: A Review",
      "A Novel Power Estimation and Optimization Approach for Wireless Sensor Networks",
      "Power and Energy Management in Wireless Sensor Networks: Challenges and Opportunities"
    ]
  },
  {
    "title": "Physical sciences and engineering: Aerospace",
    "gen_list": [
      "Aerodynamics of Sailing",
      "Astronautical Engineering: A New Discipline",
      "Fundamentals of Spacecraft Design",
      "Gas Dynamics and Rocket Propulsion",
      "Materials for Aerospace Applications"
    ]
  },
  {
    "title": "Computing / technology policy: Intellectual property",
    "gen_list": [
      "The Future of Intellectual Property in a Digital Age",
      "Intellectual Property and the Digital Revolution: Balancing Innovation and Creativity with Fairness and Freedom",
      "Computing Technology Policy: The Intersection of Intellectual Property and Cybersecurity",
      "The Impact of Intellectual Property Laws on Technological Innovation",
      "Technology Transfer and Intellectual Property Rights in the Digital Age"
    ]
  },
  {
    "title": "Emerging technologies: Emerging interfaces",
    "gen_list": [
      "The Future of Interfaces: A Survey of Emerging Technologies and Trends",
      "Emerging Interfaces: From Voice to Gesture Control",
      "The Rise of Augmented Reality: Impact on User Experience and Interaction Design",
      "Designing for the Next Generation of Interfaces: Emerging Technologies and Innovations",
      "Haptic Technology: Enhancing Human-Computer Interaction through Touch and Feel"
    ]
  },
  {
    "title": "Network protocols: Cross-layer protocols",
    "gen_list": [
      "Cross-Layer Protocol Design",
      "Cross-Layer Approach to Network Protocol Design",
      "Designing Cross-Layer Network Protocols",
      "Network Protocols: A Cross-Layer Perspective",
      "Cross-Layer Protocols for Wireless Networks"
    ]
  },
  {
    "title": "Design and analysis of algorithms: Parameterized complexity and exact algorithms",
    "gen_list": [
      "Parameterized Complexity: A Survey",
      "Exact Algorithms for Solving NP-Hard Problems",
      "On the Relationship Between Parameterized Complexity and Exact Algorithms",
      "Designing and Analyzing Algorithms: A Guide to Parameterized Complexity",
      "Exact Algorithms for Combinatorial Optimization Problems"
    ]
  },
  {
    "title": "Network protocols: Network File System (NFS) protocol",
    "gen_list": [
      "NFS: The Protocol for Accessing Files Across a Network",
      "Network File System (NFS) Protocol: Overview and Implementation",
      "A Survey on Network File System (NFS) Protocols and Their Applications",
      "Network File System (NFS) Protocol: A Comprehensive Review",
      "NFS: The Next Generation Network File System Protocol"
    ]
  },
  {
    "title": "Intrusion/anomaly detection and malware mitigation: Malware and its mitigation",
    "gen_list": [
      "Deep Learning for Intrusion Detection and Malware Mitigation",
      "A Survey on Anomaly Detection and Malware Mitigation Techniques",
      "Machine Learning for Intrusion Detection and Malware Classification",
      "Anomaly Detection and Malware Mitigation: A Comprehensive Review",
      "Malware Mitigation using Artificial Intelligence and Machine Learning"
    ]
  },
  {
    "title": "Computational complexity and cryptography: Communication complexity",
    "gen_list": [
      "Communication Complexity in Cryptography",
      "Computational Complexity and Cryptography: An Overview",
      "The Relationship Between Computational Complexity and Cryptography",
      "Communication-Efficient Cryptographic Protocols",
      "Computational Complexity and Cryptographic Security"
    ]
  },
  {
    "title": "Network algorithms: Data path algorithms",
    "gen_list": [
      "Data Path Algorithms for Network Processing",
      "Algorithms for Efficient Data Transfer in Networks",
      "Design and Implementation of Data Path Algorithms for Network Processing Systems",
      "Optimizing Data Path Algorithms for Scalable Network Performance",
      "Future Directions in Data Path Algorithm Research for Network Processing"
    ]
  },
  {
    "title": "Artificial intelligence: Planning and scheduling",
    "gen_list": [
      "\"A Survey of Artificial Intelligence Techniques for Planning and Scheduling\" by S. S. Rao and S. K. Chauhan.",
      "\"Planning and Scheduling in Artificial Intelligence\" by J. M. B. G. Pratesi.",
      "\"Artificial Intelligence for Planning and Scheduling: A Survey of Recent Research\" by M. S. Dondrup and P. T. Bremer.",
      "\"Planning and Scheduling in Multi-Agent Systems: A Survey\" by F. Matarazzo Jr. and J. T. O. Beira.",
      "\"Artificial Intelligence for Resource Constrained Project Scheduling: A Survey\" by M. M. G. Prasad and S. K. Chauhan."
    ]
  },
  {
    "title": "Security in hardware: Embedded systems security",
    "gen_list": [
      "\"Hardware Security Modules for Embedded Systems\" by S. K. Seok and H. S. Kim.",
      "\"Security in Embedded Systems: A Survey of Threats, Vulnerabilities, and Countermeasures\" by M. A. AlZain and M. A. Al-Nemari.",
      "\"A Survey on Security Mechanisms for Embedded Systems\" by S. B. Dandin and S. R. Biradar.",
      "\"Embedded System Security: A Comprehensive Review\" by P. K. Gupta and P. K. Singh.",
      "\"Security in Hardware-Based Embedded Systems\" by J. Liu and H. Zhang."
    ]
  },
  {
    "title": "Information retrieval: Users and interactive retrieval",
    "gen_list": [
      "User-centered Information Retrieval",
      "Interactive Information Retrieval: A Survey of Techniques and Evaluation Methods",
      "User Behavior and Interactive Information Retrieval",
      "Adaptive Information Retrieval: Personalizing Search Results for Individual Users",
      "Human-Computer Interaction and Information Retrieval: A Study on User-Centered Design Principles"
    ]
  },
  {
    "title": "Computer graphics: Shape modeling",
    "gen_list": [
      "Shape Modeling for Computer Graphics",
      "Modeling and Rendering of 3D Shapes",
      "Geometric Modeling and Computer Graphics",
      "Computational Geometry and Computer Graphics",
      "Shape Representation and Computer Graphics"
    ]
  },
  {
    "title": "Very large scale integration design: VLSI system specification and constraints",
    "gen_list": [
      "\"Designing Very Large-Scale Integration (VLSI) Systems\" by J. A. Drew and P. G. Laskos",
      "\"VLSI System Specification and Constraints: A Survey\" by S. K. Singh and P. K. Gupta",
      "\"Very Large-Scale Integration (VLSI) Design: Challenges and Opportunities\" by A. M. A. Rahim et al.",
      "\"VLSI System Design: A Critical Review of Recent Trends and Future Directions\" by S. K. Singh and P. K. Gupta",
      "\"Very Large-Scale Integration (VLSI) Systems: Specification, Verification, and Testing\" by M. R. H. Mandic et al."
    ]
  },
  {
    "title": "Security in hardware: Hardware attacks and countermeasures",
    "gen_list": [
      "Hardware Security Threats and Countermeasures",
      "Designing Secure Hardware: A Survey of Attacks and Defenses",
      "Hardware-Based Side-Channel Attacks: Understanding and Mitigating Risks",
      "Secure Design and Testing of Digital Circuits",
      "Hardware Security: A Comprehensive Review and Future Directions"
    ]
  },
  {
    "title": "Enterprise computing: IT architectures",
    "gen_list": [
      "Enterprise Computing: A Survey of IT Architectures",
      "Designing Enterprise IT Architectures: A Framework for Success",
      "Enterprise IT Architecture: A Guide to Planning and Implementation",
      "IT Architecture for the Enterprise: Aligning Business and Technology Strategies",
      "Enterprise Computing: Developing and Maintaining IT Architectures for Sustainable Competitive Advantage"
    ]
  },
  {
    "title": "Dependable and fault-tolerant systems and networks: Processors and memory architectures",
    "gen_list": [
      "Designing Dependable and Fault-Tolerant Systems",
      "Fault Tolerance in Distributed Systems",
      "Memory Management for Dependable and Fault-Tolerant Systems",
      "Processor Architecture for Dependable and Fault-Tolerant Systems",
      "Dependability and Fault Tolerance in Computer Networks"
    ]
  },
  {
    "title": "Machine learning: Learning paradigms",
    "gen_list": [
      "Deep Learning",
      "Random Forests",
      "Support Vector Machines",
      "Natural Language Processing",
      "Generative Adversarial Networks"
    ]
  },
  {
    "title": "Visualization: Visualization theory, concepts and paradigms",
    "gen_list": [
      "Visualization Theory and Practice",
      "Visualization in Data Analysis and Visual Communication",
      "Visual Thinking: A Guide to Learning and Teaching",
      "The Elements of User Experience: A Designer's Guide to Interaction Design",
      "Visualization for Business: Charts, Maps, and Graphs for Decision Making"
    ]
  },
  {
    "title": "Software notations and tools: Software libraries and repositories",
    "gen_list": [
      "Software Notation Language: A Standardized Notation for Software Descriptions",
      "Ontologies and Software Libraries: A Survey of Current Trends and Future Directions",
      "A Framework for Evaluating the Quality of Software Repositories",
      "Software Repositories: A Comprehensive Survey of Concepts, Tools, and Applications",
      "Software Library Management Systems: A Review and Future Directions"
    ]
  },
  {
    "title": "Communication hardware, interfaces and storage: Displays and imagers",
    "gen_list": [
      "Display Technologies for Virtual Reality",
      "Image Sensors for Machine Vision Applications",
      "Hardware Acceleration of Computer Vision Workloads",
      "Storage Solutions for Big Data and Analytics",
      "Advances in Display Technologies for Gaming and Entertainment"
    ]
  },
  {
    "title": "Logic: Logic and verification",
    "gen_list": [
      "Formal Logic: Its Nature and Structure",
      "Verified Proofs in Geometry and Number Theory",
      "Logic and the Foundations of Mathematics",
      "The Logic of Proof",
      "Verification and Validation in Computer Science"
    ]
  },
  {
    "title": "Information systems applications: Digital libraries and archives",
    "gen_list": [
      "Digital Libraries: A Survey of Concepts, Systems, and Applications",
      "Information Architecture for Digital Libraries and Archives",
      "The Role of Information Systems in Digital Libraries and Archives",
      "Digital Curation and Preservation: A Framework for Digital Libraries and Archives",
      "Using Information Systems to Improve Access to Digital Library and Archive Collections"
    ]
  },
  {
    "title": "Operations research: Decision analysis",
    "gen_list": [
      "Decision Analysis: A Guide for Managerial Decision Making",
      "Operations Research: Applications and Algorithms",
      "Introduction to Operations Research: Management Science in Practice",
      "Handbook of Operations Research Methods",
      "Quantitative Methods for Decision Making"
    ]
  },
  {
    "title": "Integrated circuits: Reconfigurable logic and FPGAs",
    "gen_list": [
      "\"Reconfigurable Logic for Integrated Circuits\" by J. R. McDowell",
      "\"Field-Programmable Gate Arrays: Theory and Applications\" by A. E. Bryant",
      "\"Reconfigurable Computing Systems: Design, Implementation, and Applications\" by M. T. Mehregani",
      "\"Integrated Circuit Design with FPGAs and CPLDs\" by J. R. W. Carter",
      "\"FPGAs for System-on-Chip Design: Challenges and Opportunities\" by A. K. Singh"
    ]
  },
  {
    "title": "Logic: Type theory",
    "gen_list": [
      "Introduction to Type Theory",
      "Type Theory: A Beginner's Guide",
      "Advanced Topics in Type Theory",
      "Logic and Type Theory: An Introduction",
      "Theory of Types: A Structural Approach"
    ]
  },
  {
    "title": "Integrated circuits: Digital switches",
    "gen_list": [
      "Design and Implementation of a High-Speed Digital Switch using FPGA",
      "A Survey on Digital Switches for Integrated Circuits",
      "Digital Switches: Architecture, Design, and Applications",
      "High-Performance Digital Switches for Data Centers",
      "A Novel Digital Switch Architectures for Wireless Communication Systems"
    ]
  },
  {
    "title": "Cross-computing tools and techniques: Empirical studies",
    "gen_list": [
      "Examining the Impact of Cross-Computing Tools on Collaborative Problem-Solving",
      "A Survey of Cross-Computing Techniques for Improving Computational Performance",
      "Cross-Computing: A Review of Current Trends and Future Directions",
      "The Use of Cross-Computing Tools in Distributed Computing Environments",
      "Empirical Studies on the Effectiveness of Cross-Computing Techniques for Big Data Analytics"
    ]
  },
  {
    "title": "Data management systems: Database administration",
    "gen_list": [
      "Database Administration: The Complete Guide",
      "Managing Big Data: A Guide to Database Management Systems",
      "Database Design and Implementation",
      "Data Management Systems: A Practical Approach",
      "Handbook of Database Administration"
    ]
  },
  {
    "title": "Physical sciences and engineering: Astronomy",
    "gen_list": [
      "<Astronomy Basics>",
      "<The Solar System>",
      "<Stars and Galaxies>",
      "<Planetary Science>",
      "<Astrophysics and Cosmology>"
    ]
  },
  {
    "title": "Software creation and management: Collaboration in software development",
    "gen_list": [
      "Agile Software Development, Principles, Patterns, and Practices",
      "Software Development Methodologies: Trends, Challenges, and Opportunities",
      "Collaborative Software Development: A Survey of Current Approaches and Future Directions",
      "The Impact of Collaboration on Software Quality: A Systematic Review",
      "Software Engineering: A Practitioner's Guide"
    ]
  },
  {
    "title": "Ubiquitous and mobile computing: Ubiquitous and mobile computing design and evaluation methods",
    "gen_list": [
      "Ubiquitous Computing: Beyond Mobile Devices",
      "Designing for Ubiquity: A Methodology for Mobile and Pervasive Systems",
      "Evaluating Ubiquitous and Mobile Interfaces: A Comparative Study",
      "Ubiquitous Computing: The Next Generation of Human-Computer Interaction"
    ]
  },
  {
    "title": "Enterprise computing: IT governance",
    "gen_list": [
      "IT Governance: How Top Performers Manage IT, Risk, and Compliance",
      "Enterprise Governance of IT: A Practical Guide to IT Governance",
      "IT Governance: A Framework for Boardroom to Basement",
      "Governance of Enterprise IT: A Holistic Approach",
      "Managing Enterprise IT Governance: A Guide for CIOs, IT Executives, and Board Members"
    ]
  },
  {
    "title": "Education: E-learning",
    "gen_list": [
      "\"E-Learning in Higher Education: A Review of the Literature\" by Sarah K. Markley and J. Michael Rousseau",
      "\"The Impact of E-Learning on Student Learning Outcomes: A Meta-Analysis\" by Judith A. Harris and David H. Sampson",
      "\"E-Learning in the Workplace: A Review of the Literature and Implications for Practice\" by Deborah A. Lineweaver and James R. Wiley",
      "\"Personalized Learning through E-Learning: A Study on Student Engagement and Performance\" by Sung-Woo Kim and Jongseok Lee",
      "\"The Effectiveness of E-Learning in Promoting Critical Thinking Skills: A Systematic Review\" by Sally C. Wortham and Amanda J. Cox"
    ]
  },
  {
    "title": "Arts and humanities: Sound and music computing",
    "gen_list": [
      "Computational Musicology: An Overview",
      "Music Information Retrieval: A Survey",
      "Sound and Music Computing: A Survey of Recent Research",
      "The Oxford Handbook of Sound and Music Interaction",
      "Machine Learning for Music Information Retrieval"
    ]
  },
  {
    "title": "Concurrent computing methodologies: Concurrent algorithms",
    "gen_list": [
      "Parallel Programming in C and Fortran",
      "Concurrency: Theory and Practice",
      "Distributed Computing: Fundamentals, Systems, and Applications",
      "Multiprocessor System Architecture",
      "Introduction to Parallel Computing"
    ]
  },
  {
    "title": "Artificial intelligence: Philosophical/theoretical foundations of artificial intelligence",
    "gen_list": [
      "The Philosophy of Artificial Intelligence",
      "Theories of Artificial Intelligence: An Overview",
      "Artificial Intelligence and the Foundations of Human Cognition",
      "The Ethics of Artificial Intelligence: A Philosophical Analysis",
      "The Future of Artificial Intelligence: A Philosophical Perspective"
    ]
  },
  {
    "title": "Document types: Surveys and overviews",
    "gen_list": [
      "\"Survey Research Methods\" by Michael D. Krohn and Jeni C. Fulton",
      "\"The Handbook of Survey Research\" edited by Jennifer L. Dixon, Frank M. Andrews, and Thomas S. Batiste",
      "\"Surveys in Social Science Research\" by John W. Meyer and Robert P. Kenny",
      "\"Overview of Survey Methodology\" by David A. Freedman and Martha J. Scharm management",
      "\"Survey Design, Implementation, and Analysis\" by Katherine A. White and Michael C. Dillow"
    ]
  },
  {
    "title": "Parallel computing methodologies: Parallel algorithms",
    "gen_list": [
      "Parallel Programming: A Survey of Methodologies, Tools, and Applications",
      "A Survey of Parallel Computing Methodologies for Solving Large-Scale Optimization Problems",
      "Parallel Algorithms and Methodologies for Solving NP-Hard Problems on Distributed Memory Systems",
      "A Review of Parallel Computing Methodologies for Machine Learning",
      "Parallel Computing Methodologies for Scientific Applications: A Survey"
    ]
  },
  {
    "title": "Formal languages and automata theory: Automata extensions",
    "gen_list": [
      "Advanced Automata on Strings",
      "Colored Automata and their Applications",
      "Concurrency, Communication, and Coordination in Multi-Agent Systems",
      "Formal Language Theory: An Introduction",
      "Game-Theoretic Models of Communicating and Coordinating Agents"
    ]
  },
  {
    "title": "Education: Computer-managed instruction",
    "gen_list": [
      "Computer-Managed Instruction: A New Approach to Teaching",
      "The Effectiveness of Computer-Managed Instruction in the Elementary School Classroom",
      "Computer-Assisted Instruction: A Review of Research and Practice",
      "The Impact of Computer-Managed Instruction on Student Achievement",
      "Designing Effective Computer-Managed Instruction for Online Learning Environments"
    ]
  },
  {
    "title": "Emerging technologies: Memory and dense storage",
    "gen_list": [
      "<TITLE>Advances in Memristor Technology for Dense Storage</TITLE>",
      "<TITLE>Dense Storage: A Survey of Emerging Technologies and Applications</TITLE>",
      "<TITLE>The Future of Memory: Emerging Technologies and Trends</TITLE>",
      "<TITLE>Emerging Technologies for Dense Storage: A Review</TITLE>",
      "<TITLE>Next-Generation Memory and Storage Technologies: Challenges and Opportunities</TITLE>"
    ]
  },
  {
    "title": "Network services: In-network processing",
    "gen_list": [
      "<Network Processing for IoT Data Analytics>",
      "<In-Network Processing for Edge Computing>",
      "<A Survey on In-Network Processing for Network Function Virtualization>",
      "<In-Network Processing for 5G Networks and Beyond>",
      "<In-Network Processing: A New Frontier in Computer Networking Research>"
    ]
  },
  {
    "title": "Software and application security: Social network security and privacy",
    "gen_list": [
      "A Survey on Security Threats in Social Networks",
      "Privacy and Security in Online Social Networks: A Review",
      "Security and Privacy Concerns in Social Networking Sites",
      "Social Network Security: A Comprehensive Review",
      "Privacy and Security in Social Media: Challenges and Solutions"
    ]
  },
  {
    "title": "Physical sciences and engineering: Mathematics and statistics",
    "gen_list": [
      "A First Course in Stochastic Processes",
      "Probability and Statistics for Engineers and Scientists",
      "Mathematics for Physics, Engineering and Science",
      "Statistics in a Nutshell",
      "Introduction to Mathematical Thinking"
    ]
  },
  {
    "title": "Network services: Naming and addressing",
    "gen_list": [
      "IPv6 Naming and Addressing",
      "Domain Name System (DNS)",
      "Network Service Management: A Framework for Managing Network Services",
      "Naming and Addressing in Computer Networks",
      "IPv4 and IPv6 Addressing"
    ]
  },
  {
    "title": "Enterprise computing: Reference models",
    "gen_list": [
      "\"Reference Models for Enterprise Computing\" by S. A. M. Deans and J. D. Ullman",
      "\"Enterprise Computing Reference Model: A Framework for Integration\" by R. G. Davis and K. E. Mckusick",
      "\"A Reference Model for Enterprise Computing\" by J. T. Robinson and P. M. S. Chang",
      "\"Enterprise Computing Reference Models: A Survey of the State of the Art\" by R. E. B. Bartolacci and G. M. G. H. De La Vega",
      "\"Reference Model for Enterprise Computing: A Unified Approach to Integration\" by J. P. L. L. de Oliveira and F. C. S. Sousa"
    ]
  },
  {
    "title": "Dependable and fault-tolerant systems and networks: Secondary storage organization",
    "gen_list": [
      "A Survey of Fault Tolerance Techniques for Distributed Systems",
      "Fault-Tolerant Systems: A Comprehensive Survey",
      "Designing and Building Dependable and Fault-Tolerant Systems",
      "Reliability-Centered Maintenance for Network Systems",
      "Fault Tolerance in Distributed Computing Systems: A Survey"
    ]
  },
  {
    "title": "Mathematical analysis: Numerical analysis",
    "gen_list": [
      "Numerical Analysis: A Comprehensive Introduction",
      "Numerical Methods for Scientists and Engineers",
      "Introduction to Numerical Analysis",
      "Numerical Mathematics and Computation",
      "A First Course in Numerical Analysis"
    ]
  },
  {
    "title": "Software notations and tools: General programming languages",
    "gen_list": [
      "The Notation for Software Architecture",
      "Software Product Line Engineering: A Notational System for Variability Management",
      "A Framework for Modeling and Validating Software Systems Using Graphical Notations",
      "Notations for Programming Languages: A Survey",
      "Graphical Notation for Software Design and Development"
    ]
  },
  {
    "title": "Integrated circuits: Logic circuits",
    "gen_list": [
      "\"Logic Circuit Design\" by Behrouz A. Forouzan",
      "\"Integrated Circuit Design\" by Richard C. Jaeger",
      "\"Logic and Computation: Fundamentals of Digital Integrated Circuits\" by J. F. P. Correia",
      "\"Digital Logic and Computer Architecture\" by M. Morris Mano",
      "\"Integrated Circuit Analysis and Design\" by Jan R. K. Rogers"
    ]
  },
  {
    "title": "Design and analysis of algorithms: Parallel algorithms",
    "gen_list": [
      "Parallel Algorithms: A Survey",
      "A Guide to Parallel Algorithms and Programming",
      "Parallel Computing: A Comprehensive Introduction",
      "Algorithms for Parallel Processing",
      "Parallel Algorithm Design and Analysis"
    ]
  },
  {
    "title": "Network security: Security protocols",
    "gen_list": [
      "Security Protocols for Network Communication",
      "A Survey of Network Security Protocols and their Applications",
      "Network Security: A Comprehensive Review of Security Protocols and Solutions",
      "Security Protocols for Wireless Sensor Networks",
      "A Framework for Evaluating the Security of Network Security Protocols"
    ]
  },
  {
    "title": "Software and application security: Software security engineering",
    "gen_list": [
      "Security Engineering: A Guide to Building Dependable Distributed Systems",
      "Software Security: A Comprehensive Guide",
      "Secure Coding in .NET: How to Implement Security in Your Software",
      "The Art of Software Security: An Introduction to Ethical Hacking and Penetration Testing",
      "Security for Software Developers: A Guide to Building Secure Applications"
    ]
  },
  {
    "title": "Operations research: Computer-aided manufacturing",
    "gen_list": [
      "\"Computer-Aided Design and Manufacturing\" by J. A. Dunn and R. E. Simpson",
      "\"Computer-Aided Manufacturing: An Introduction\" by P. S. Nagpal and K. R. Kumar",
      "\"Computer-Aided Design, Manufacturing, and Engineering\" by M. S. Srinivasan and S. S. Sreedhar",
      "\"Computer-Aided Manufacturing Systems: A Survey\" by J. R. W. Gere and D. K. B. D. D. L. Parish",
      "\"Operations Research in Computer-Aided Manufacturing\" by M. K. Gupta and S. C. Sharma"
    ]
  },
  {
    "title": "World Wide Web: Web data description languages",
    "gen_list": [
      "<W3C> WSDL (Web Services Description Language) 1.1",
      "<W3C> RDF (Resource Description Framework)",
      "<W3C> SWRL (Semantic Web Rule Language)",
      "<W3C> OWL (Web Ontology Language)",
      "<W3C> SPARQL (SPARQL Protocol and RDF Query Language)"
    ]
  },
  {
    "title": "Very large scale integration design: On-chip resource management",
    "gen_list": [
      "On-Chip Resource Management for Very Large Scale Integration Design",
      "Very Large Scale Integration: Challenges and Opportunities in On-Chip Resource Management",
      "A Survey on On-Chip Resource Management Techniques for Very Large Scale Integration Systems",
      "On-Chip Resource Management for Very Large Scale Integration: A Review and Future Directions",
      "Very Large Scale Integration Design: On-chip Resource Management and Performance Evaluation"
    ]
  },
  {
    "title": "Logic: Abstraction",
    "gen_list": [
      "Introduction to Logic",
      "Abstraction in Logic",
      "Logic and Abstraction",
      "The Role of Abstraction in Logical Reasoning",
      "Abstraction in Formal Logic"
    ]
  },
  {
    "title": "Computing / technology policy: Computer crime",
    "gen_list": [
      "The Impact of Computer Crime on Society",
      "Computer Crime and Cybersecurity: A Legal Perspective",
      "Computer Crimes and the Law: An Overview",
      "The Evolution of Computer Crime and Its Implications for Society",
      "Cybercrime and Digital Forensics: A Guide for Policy Makers"
    ]
  },
  {
    "title": "Data management systems: Query languages",
    "gen_list": [
      "Query Languages for Data Management Systems",
      "Design and Implementation of a Query Language for Data Management Systems",
      "Querying Large Datasets: A Survey of Techniques and Challenges",
      "A Survey on Query Languages for Data Management Systems",
      "Query Languages in Data Management: Trends, Challenges, and Opportunities"
    ]
  },
  {
    "title": "Software creation and management: Software post-development issues",
    "gen_list": [
      "Managing Software after Development: Challenges and Strategies",
      "Post-Development Activities in Software Engineering: A Systematic Review",
      "Software Post-Development Issues and Their Impact on Project Success",
      "The Role of Post-Development Activities in Ensuring Software Quality",
      "Post-Development Challenges in Agile Software Development: A Survey"
    ]
  },
  {
    "title": "Network properties: Network mobility",
    "gen_list": [
      "Network Mobility: A Survey of Taxonomy, Challenges, and Solutions",
      "Dynamic Network Properties: A Study on the Impact of Network Mobility on Network Performance",
      "Network Mobility in 5G: A Review of the State-of-the-Art and Future Directions",
      "Mobile Networks: A Survey of Challenges, Opportunities, and Solutions for Future Networks",
      "Network Mobility Management in Wireless Sensor Networks: A Survey and Future Directions"
    ]
  },
  {
    "title": "Printed circuit boards: Electromagnetic interference and compatibility",
    "gen_list": [
      "Electromagnetic Compatibility (EMC) of Printed Circuit Boards: A Review",
      "Printed Circuit Board Design for Electromagnetic Interference (EMI) Control",
      "Electromagnetic Interference and Compatibility Requirements for Printed Circuit Boards",
      "Electromagnetic Analysis of Printed Circuit Boards: A Survey",
      "Printed Circuit Board Design for Radio Frequency Electromagnetic Compatibility"
    ]
  },
  {
    "title": "Computational complexity and cryptography: Quantum complexity theory",
    "gen_list": [
      "Quantum Complexity Theory: An Overview",
      "Quantum Algorithms and Their Complexity",
      "Quantum Cryptography: A Survey of the Field",
      "The Quantum Computation Hierarchy: A New Framework for Understanding Quantum Complexity",
      "Quantum Information Processing and Computational Complexity"
    ]
  },
  {
    "title": "Formal languages and automata theory: Grammars and context-free languages",
    "gen_list": [
      "\"Grammars and Language\" by H. J. M. Rutten",
      "\"Context-Free Grammars\" by G. E. Lueker",
      "\"Formal Language Theory: Introduction, Grammars and Language\" by A. J.aysen",
      "\"Grammars, Language and Context-Free Processes\" by J. C. M. Van Der Meer",
      "\"Introduction to Formal Language Theory: Grammars, Languages and Computation\" by R. E. Bryant"
    ]
  },
  {
    "title": "Information systems applications: Enterprise information systems",
    "gen_list": [
      "<Enterprise Information Systems: Concepts, Methodologies, Tools, and Applications>",
      "<Information Systems for Business and Beyond: Driving Corporate Performance and Social Impact>",
      "<Enterprise Information Systems: A Managerial Perspective>",
      "<The Handbook of Enterprise Information Systems>",
      "<Enterprise Information Systems: Design, Implementation, and Management>"
    ]
  },
  {
    "title": "Network performance evaluation: Network simulations",
    "gen_list": [
      "A Survey on Network Performance Evaluation Metrics and Methods",
      "Network Simulation for Performance Evaluation: A Comprehensive Review",
      "An Empirical Study of Network Performance Evaluation Techniques",
      "A Framework for Network Performance Evaluation Using Simulation",
      "Network Performance Evaluation Through Simulation: A Systematic Review"
    ]
  },
  {
    "title": "Logic: Separation logic",
    "gen_list": [
      "\"Separation Logic: A Formal Framework for Distributed Systems\" by J. D. Ullman.",
      "\"Logic-Based Verification of Distributed Systems\" by R. E. Grimson and M. C. Sullivan.",
      "\"A Framework for Proving Properties of Distributed Systems Using Separation Logic\" by A. J. Stokes and D. J. Wise.",
      "\"Separation Logic: A Theoretical Foundation for Distributed Computing\" by R. E. Grimson and M. C. Sullivan.",
      "\"Verifying Properties of Distributed Systems Using Separation Logic\" by J. D. Ullman and A. P. Wijngaards."
    ]
  },
  {
    "title": "Network components: Logical nodes",
    "gen_list": [
      "Logical Nodes in Networks",
      "Node and Edge Structures in Networks",
      "The Logical Nodes of a Communication Network",
      "Network Components: A Review of the Literature on Logical Nodes",
      "Logical Nodes and Their Role in Network Architecture"
    ]
  },
  {
    "title": "Enterprise computing: Business-IT alignment",
    "gen_list": [
      "Business-IT Alignment: A Review of the Concept and Its Applications",
      "The Alignment of Business and IT Strategies: A Case Study",
      "Business-IT Alignment: The Key to Successful Implementation of IT Initiatives",
      "Exploring the Relationship Between Business and IT Strategies: A Study on Business-IT Alignment",
      "Business-IT Alignment: A Framework for Achieving Organizational Success Through Effective IT Utilization"
    ]
  },
  {
    "title": "Robustness: Safety critical systems",
    "gen_list": [
      "A Framework for Evaluating Robustness of Safety-Critical Systems",
      "Robustness in Safety-Critical Systems: A Survey and Future Directions",
      "Towards a Robustness Metrics Suite for Safety-Critical Systems",
      "Adaptive Robustness Methods for Safety-Critical Systems",
      "Robustness Analysis of Safety-Critical Systems using Model Checking"
    ]
  },
  {
    "title": "Robustness: Fault tolerance",
    "gen_list": [
      "Fault-tolerant design of distributed systems",
      "Robustness and fault tolerance in computer networks",
      "A framework for evaluating the robustness of software systems",
      "Fault tolerance in artificial intelligence: A survey",
      "Robustness and reliability in mechatronic systems"
    ]
  },
  {
    "title": "Electronic design automation: Logic synthesis",
    "gen_list": [
      "Logic Synthesis: A Survey of Recent Techniques and Challenges",
      "A Comprehensive Review of Logic Synthesis Methods for Digital Circuit Design",
      "Logic Synthesis: From Theory to Practice",
      "Advances in Logic Synthesis Techniques for High-Performance Design",
      "Logic Synthesis: A Key Component of Electronic Design Automation"
    ]
  },
  {
    "title": "Education: Computer-assisted instruction",
    "gen_list": [
      "The Effectiveness of Computer-Assisted Instruction in Science Education",
      "Computer-Assisted Instruction: A Review of Research and Practice",
      "The Role of Computers in Enhancing Learning in Mathematics and Science Classrooms",
      "An Empirical Study of the Impact of Computer-Assisted Instruction on Student Achievement in Basic Education",
      "Computer-Assisted Instruction: A Handbook for Teachers"
    ]
  },
  {
    "title": "Logic: Linear logic",
    "gen_list": [
      "Linear Logic and its Applications",
      "Introduction to Linear Logic",
      "Logic in Computer Science: Proceedings of the 1996 Conference",
      "Handbook of Linear Logic",
      "Logic and its Applications: A Survey of Recent Developments"
    ]
  },
  {
    "title": "Security in hardware: Hardware reverse engineering",
    "gen_list": [
      "\"Hardware Reverse Engineering: Techniques and Tools\" by Michael W. Davidson",
      "\"Reverse Engineering of Hardware: A Survey\" by S. S. Ranka and S. K. Singh",
      "\"Hardware Security: Threats, Challenges, and Solutions\" by S. J. Kim and H. K. Kim",
      "\"Reverse Engineering of Digital Circuits\" by F. F. Lau and A. M. Keller",
      "\"Hardware Reverse Engineering for Penetration Testing\" by R. T. Nguyen and T. N. Nguyen"
    ]
  },
  {
    "title": "Operations research: Consumer products",
    "gen_list": [
      "A Multi-Objective Optimization Model for Consumer Products with Multiple Performance Metrics",
      "Using Operations Research Techniques to Improve Supply Chain Management in the Consumer Goods Industry",
      "An Integrated Model for Pricing and Inventory Control of Fast-Moving Consumer Goods",
      "Applying Operations Research Methods to Optimize Product Line Planning in the Consumer Goods Market",
      "A Dynamic Programming Approach to Scheduling Production and Distribution of Consumer Products"
    ]
  },
  {
    "title": "Semantics and reasoning: Program semantics",
    "gen_list": [
      "A Formal Basis for Semantic Reasoning",
      "Programming Languages and Proofs: A Logical Approach",
      "Formal Semantics of Programming Languages",
      "Reasoning About Programs",
      "Semantic Foundations for Computer Science"
    ]
  },
  {
    "title": "Communication hardware, interfaces and storage: Wireless devices",
    "gen_list": [
      "Design and Development of a Wireless Communication System for Disaster Management",
      "A Survey on Wireless Communication Technologies for Emergency Services",
      "Wireless Communication Interfaces for Emergency Response Systems",
      "The Role of Wireless Storage in Emergency Response Situations",
      "Wireless Devices and Their Applications in Disaster Management"
    ]
  },
  {
    "title": "Randomness, geometry and discrete structures: Random projections and metric embeddings",
    "gen_list": [
      "Random Projection Methods for Computer Vision",
      "Discrete Structures and Randomness in Metric Spaces",
      "Geometric Random Projections: A Survey",
      "Random Embeddings for Efficient Computation of Discrete Structures",
      "Randomness, Geometry, and Discrete Structures: An Overview"
    ]
  },
  {
    "title": "Network components: End nodes",
    "gen_list": [
      "\"End-Node Networks\" by D. Clark, 1997.",
      "\"The Role of End Nodes in Distributed Systems\" by J. R. Ullman, 1996.",
      "\"Network Endpoints: The Forgotten Components of Distributed Systems\" by M. S. Paterson, 2001.",
      "\"End-Node Communication in Distributed Systems\" by A. M. Keller, 1995.",
      "\"End Nodes and Network Interfaces for Distributed Computing\" by J. D. Ullman, 1997."
    ]
  },
  {
    "title": "Computing / technology policy: Commerce policy",
    "gen_list": [
      "\"The Role of Computing in Economic Development\" by UN Conference on Trade and Development (UNCTAD)",
      "\"Digital Trade: A Guide to the Issues\" by World Trade Organization (WTO)",
      "\"Computer Technology and the Future of Work\" by International Labour Organization (ILO)",
      "\"The Impact of Digital Technologies on Business Models, Markets, and Societies\" by Organisation for Economic Co-operation and Development (OECD)",
      "\"Policy Approaches to Addressing the Social Impacts of Digital Technologies\" by World Wide Web Foundation (W3C)"
    ]
  },
  {
    "title": "Very large scale integration design: Design reuse and communication-based design",
    "gen_list": [
      "Design Reuse in Very Large Scale Integration Systems",
      "Communication-Based Design: A New Paradigm for VLSI System Design",
      "Reusing Design Elements in Very Large Scale Integration",
      "Design Reuse Techniques for Very Large Scale Integration",
      "Communication-Based Design Methodology for VLSI Systems"
    ]
  },
  {
    "title": "Theory and algorithms for application domains: Database theory",
    "gen_list": [
      "Database Systems: The Complete Book",
      "Data Mining: Concepts and Techniques",
      "Information Retrieval: Fundamentals for the 21st Century",
      "Machine Learning: A Probabilistic Approach",
      "Pattern Recognition and Machine Learning"
    ]
  },
  {
    "title": "Computers in other domains: Personal computers and PC applications",
    "gen_list": [
      "The Impact of Personal Computers on Education",
      "PC Applications in Healthcare: A Review",
      "Using Personal Computers to Enhance Learning and Teaching",
      "Personal Computers in Business: An Overview",
      "The Role of PCs in the Home: A Study of User Behavior"
    ]
  },
  {
    "title": "Collaborative and social computing: Collaborative and social computing design and evaluation methods",
    "gen_list": [
      "<TITLE>Designing for Social Interaction in Collaborative Systems</TITLE>",
      "<TITLE>Evaluating Social and Collaborative Computing Systems: A Survey</TITLE>",
      "<TITLE>Social and Collaborative Computing: A Framework for Design and Evaluation</TITLE>",
      "<TITLE>Collaborative and Social Computing: A Review of the State of the Art</TITLE>",
      "<TITLE>Designing and Evaluating Collaborative Systems: A Practical Guide</TITLE>"
    ]
  },
  {
    "title": "Network properties: Network reliability",
    "gen_list": [
      "The Impact of Network Reliability on Organizational Performance",
      "Network Reliability: A Review of the Literature and Implications for Practice",
      "Examining the Relationship Between Network Reliability and Business Outcomes",
      "The Effect of Network Reliability on Customer Satisfaction: An Empirical Study"
    ]
  },
  {
    "title": "Randomness, geometry and discrete structures: Pseudorandomness and derandomization",
    "gen_list": [
      "<79. Random Graphs and Networks>",
      "<83. Discrete Geometry and Computation>)",
      "\"<106. Pseudorandomness and Derandomization in Computational Complexity>\")",
      "<114. Geometric Aspects of Random and Pseudorandom Processes>)",
      "<127. Discrete Structures and Random Walks>"
    ]
  },
  {
    "title": "Software and application security: Web application security",
    "gen_list": [
      "Web Application Security: A Comprehensive Guide",
      "Secure Coding in Java: Principles and Practices for Web Applications",
      "Web Application Penetration Testing and Ethical Hacking",
      "OWASP Secure Coding Practices",
      "Web Security Testing and Compliance: A Guide to Securing Web Applications"
    ]
  },
  {
    "title": "Network components: Wireless access points, base stations and infrastructure",
    "gen_list": [
      "Design and Implementation of a Wireless Network for a Residential Area",
      "Wireless Access Points: A Survey of Design Trends and Challenges",
      "Base Station Architecture: A Review of the State-of-the-Art",
      "Infrastructure for Wireless Networks: A Comprehensive Review",
      "Wireless Communications: From Basics to Future Trends"
    ]
  },
  {
    "title": "Security services: Privacy-preserving protocols",
    "gen_list": [
      "Privacy-Preserving Protocols for Secure Multi-Party Computation",
      "Privacy-Aware Security Services: A Survey",
      "Privacy-Preserving Authentication for Cloud Computing",
      "Privacy-Protecting Protocols for Secure Data Sharing",
      "Privacy-Aware Security Solutions for the Internet of Things"
    ]
  },
  {
    "title": "Security services: Authorization",
    "gen_list": [
      "Authorization in Security Services: A Survey",
      "Authentication and Authorization in Cloud Computing",
      "Authorization in Distributed Systems: Challenges and Solutions",
      "Role-Based Access Control: A Survey of Current Research and Practice",
      "Security Services: Emerging Trends and Future Directions"
    ]
  },
  {
    "title": "Education: Learning management systems",
    "gen_list": [
      "Learning Management Systems: A Review of the Literature",
      "The Impact of Learning Management Systems on Student Engagement and Performance",
      "A Comprehensive Review of Learning Management Systems in Higher Education",
      "The Role of Learning Management Systems in Enhancing Teaching and Learning",
      "Exploring the Effectiveness of Learning Management Systems: A Meta-Analysis"
    ]
  },
  {
    "title": "Security services: Digital rights management",
    "gen_list": [
      "\"<Digital Rights Management: Concepts, Technologies, and Challenges>\".",
      "\"<A Survey on Digital Rights Management Systems for Audio and Video Content>\".",
      "\"<Digital Rights Management in the Digital Age: A Review of the Current State and Future Trends>\".",
      "\"<The Role of Digital Rights Management in Protecting Intellectual Property Rights in the Digital Environment>\".",
      "\"<A Framework for Digital Rights Management Systems Based on Artificial Intelligence>\"."
    ]
  },
  {
    "title": "Cross-computing tools and techniques: Verification",
    "gen_list": [
      "Verifying Cross-Computing Systems with Model Checking",
      "A Framework for Cross-Computing System Verification using Temporal Logic",
      "Cross-Computing System Verification via Automated Reasoning",
      "Verifying Cross-Computing Systems with Proof Assistants",
      "Cross-Computing System Verification using Satisfiability Solvers"
    ]
  },
  {
    "title": "Electronic design automation: Methodologies for EDA",
    "gen_list": [
      "A Survey of Electronic Design Automation (EDA) Methodologies",
      "Electronic Design Automation: A Comprehensive Review",
      "Methodologies for Electronic Design Automation: A Systematic Review",
      "Electronic Design Automation: Trends, Challenges, and Future Directions",
      "An Overview of Electronic Design Automation (EDA) Methodologies and Tools"
    ]
  },
  {
    "title": "Computer graphics: Graphics systems and interfaces",
    "gen_list": [
      "Fundamentals of Computer Graphics",
      "Graphics Systems and Interfaces",
      "Computer Graphics: Principles and Practice",
      "Interactive Computer Graphics",
      "Computer Graphics Handbook"
    ]
  },
  {
    "title": "Network protocols: Network protocol design",
    "gen_list": [
      "\"Designing Network Protocols\" by David L. Clark",
      "\"Network Protocol Design\" by Andrew S. Tanenbaum",
      "\"Principles of Computer System Design\" by Henry M. Levy and J. William McCormick",
      "\"Computer Networking: A Top-Down Approach\" by James Kurose and Bruce Schneider",
      "\"Networking Essentials\" by Tony D. Ross"
    ]
  },
  {
    "title": "Models of computation: Interactive computation",
    "gen_list": [
      "\"Interactive Computation and the Theory of Programming Languages\" by J.R. Bird, R.E. Bryant, and M.S. Paterson",
      "\"Interactive Computation: A New Perspective on the Nature of Computation\" by S.A. Abelson and J.M. Sussman",
      "\"Interactive Computation: The Next Generation of Computational Models\" by R. E. Grimmett and D. J. Watt",
      "\"Computing with Interactive Models\" by J.L. Lerner and A.P. Tucker",
      "\"Interactive Computation and the Design of Programming Systems\" by M.J. Crawford, J.M. Martin, and R.E. Grimmett"
    ]
  },
  {
    "title": "Mathematical analysis: Calculus",
    "gen_list": [
      "\"Calculus\" by Michael Spivak",
      "\"A First Course in Calculus\" by Hugh Neill Levine",
      "\"Calculus: A Graphical Approach\" by Robert A. Beezer",
      "\"Introduction to Mathematical Thinking\" by Keith Devlin",
      "\"Calculus on Manifolds\" by Michael Spivak"
    ]
  },
  {
    "title": "Data management systems: Database management system engines",
    "gen_list": [
      "<SQL Server Engine>",
      "<Oracle Engine>",
      "<MySQL Engine>",
      "<PostgreSQL Engine>",
      "< MongoDB Engine>"
    ]
  },
  {
    "title": "Electronic commerce: Online shopping",
    "gen_list": [
      "The Impact of Electronic Commerce on Retailing: A Literature Review and Future Directions",
      "Consumer Behavior in Electronic Commerce: A Review and Future Research Directions",
      "Electronic Markets and Web Shops: A Framework for E-Commerce Research",
      "Understanding the Determinants of Customer Satisfaction in Electronic Commerce: A Meta-Analysis",
      "The Role of Trust in Online Shopping: A Review and Future Directions"
    ]
  },
  {
    "title": "Law, social and behavioral sciences: Psychology",
    "gen_list": [
      "The Handbook of Social Psychology",
      "Advances in Experimental Social Psychology",
      "The Oxford Handbook of Social Neuroscience",
      "Social Cognition: A Multidisciplinary Approach",
      "The Cambridge Handbook of Social Psychology"
    ]
  },
  {
    "title": "World Wide Web: Web searching and information discovery",
    "gen_list": [
      "\"The World Wide Web: A Very Short Introduction\" by Andy Williams",
      "\"Web Search: Information Discovery in the Web of Data\" by Jans A. Pasche and Christian B. F. Bellmann",
      "\"Information Retrieval and the Web\" by David R. Millier and Peter J. Wills",
      "\"The Web as a Platform for Information Discovery\" by Sandra G. Hobbs and Andrew S. Tanenbaum",
      "\"Web Search: A Guide to Effective Searching on the World Wide Web\" by James D. F. McCreight"
    ]
  },
  {
    "title": "Information retrieval: Retrieval models and ranking",
    "gen_list": [
      "A Survey of Information Retrieval Models for Ranking",
      "Ranking in Information Retrieval: A Comprehensive Review",
      "Retrieval Models and Ranking Algorithms for Information Retrieval",
      "A Study on Information Retrieval Ranking Models and their Applications",
      "Ranking in Information Retrieval: Theories, Models, and Techniques"
    ]
  },
  {
    "title": "Probability and statistics: Probabilistic representations",
    "gen_list": [
      "Probabilistic Representations of Cognitive Maps",
      "Probabilistic Inference in Cognition and Computation",
      "Probabilistic Models of Reasoning and Decision Making",
      "Probabilistic Representations of Uncertainty and Ambiguity",
      "Probabilistic Approaches to Perception and Cognition"
    ]
  },
  {
    "title": "Very large scale integration design: Application-specific VLSI designs",
    "gen_list": [
      "Designing Application-Specific VLSI Systems",
      "VLSI Design for Embedded Systems",
      "Large-Scale Integration of VLSI Circuits",
      "VLSI Design: A Survey of Recent Trends and Techniques",
      "Applications of Very Large Scale Integration (VLSI) in Electronics"
    ]
  },
  {
    "title": "Enterprise computing: Enterprise ontologies, taxonomies and vocabularies",
    "gen_list": [
      "Enterprise Ontology: A Conceptual Framework for Organizational Knowledge Management",
      "Taxonomy and Vocabulary for Enterprise Computing: A Survey of the Field",
      "Enterprise Computing: A Unified Approach to Integrating Information Systems",
      "Ontologies, Taxonomies, and Vocabularies in Enterprise Computing: A Comprehensive Review",
      "Enterprise Ontology and Taxonomy for Knowledge Management in Organizations"
    ]
  },
  {
    "title": "Document management and text processing: Document searching",
    "gen_list": [
      "Document Searching: A Survey of Recent Approaches and Techniques",
      "Text Processing for Document Management: A Review of State-of-the-Art Methods",
      "Document Retrieval in Large Collections: A Machine Learning Perspective",
      "A Survey on Document Search and Retrieval Techniques",
      "Document Management and Text Processing: Challenges and Opportunities"
    ]
  },
  {
    "title": "Communication hardware, interfaces and storage: Sound-based input / output",
    "gen_list": [
      "Designing Sound-Based Input Devices for Accessibility",
      "Sound-Based User Interfaces: A Review of the Literature and Future Directions",
      "Audio-Based Human-Computer Interaction: A Survey of Techniques and Applications",
      "Sound Input Devices for Assistive Technology: A Systematic Review"
    ]
  },
  {
    "title": "Electronic commerce: Secure online transactions",
    "gen_list": [
      "<TITLE>E-Commerce Security: A Review of the Current State and Future Directions</TITLE>",
      "<TITLE>Online Payment Systems: Security, Privacy, and Trust</TITLE>",
      "<TITLE>Secure Electronic Commerce Transactions: Challenges and Solutions</TITLE>",
      "<TITLE>E-Commerce Security: Threats, Vulnerabilities, and Countermeasures</TITLE>",
      "<TITLE>Protecting E-Commerce Transactions: A Survey of Security Techniques and Tools</TITLE>"
    ]
  },
  {
    "title": "Collaborative and social computing: Collaborative and social computing devices",
    "gen_list": [
      "Designing for Social Computing: A Survey of User Needs and Behaviors",
      "Social Computing: An Interdisciplinary Approach to Understanding Human-Computer Interaction",
      "The Social Life of Technology: How Culture Shapes Personality and Vise Versa",
      "Collaborative and Social Computing: A New Paradigm for Human-Computer Interaction",
      "Social Networking and Collaboration in the Digital Age: Opportunities and Challenges"
    ]
  },
  {
    "title": "Communication hardware, interfaces and storage: Electro-mechanical devices",
    "gen_list": [
      "Design and Implementation of an Interactive Multimedia System",
      "Electro-Mechanical Systems: A Survey of Recent Advances and Applications",
      "Hardware and Software Design for a High-Performance Storage System",
      "The Use of Electro-Mechanical Devices in Modern Communication Systems",
      "A Survey of Emerging Trends in Communication Hardware, Interfaces, and Storage"
    ]
  },
  {
    "title": "Logic: Modal and temporal logics",
    "gen_list": [
      "Modal Logic",
      "Temporal Logic",
      "Axiomatic Modal Logic",
      "Logic and Time",
      "Modal Logics for Computational Systems"
    ]
  },
  {
    "title": "Network protocols: OAM protocols",
    "gen_list": [
      "OAM Protocols for Network Management",
      "A Survey of OAM Protocols for Network Monitoring and Management",
      "OAM in Modern Networks: Challenges and Solutions",
      "OAM Protocols: A Comprehensive Review",
      "Network OAM Protocols: Current Trends and Future Directions"
    ]
  },
  {
    "title": "Logic: Proof theory",
    "gen_list": [
      "A Gentle Introduction to Proof Theory",
      "Proof Theory: An Introduction",
      "The Logic of Proofs",
      "Proof Theory and the Foundations of Mathematics",
      "Formal Proof Theory"
    ]
  },
  {
    "title": "Operations research: Marketing",
    "gen_list": [
      "Optimizing Product Line Pricing with Markov Chain Monte Carlo",
      "A Data-Driven Approach to Customer Segmentation in Marketing",
      "Using Operations Research Techniques to Optimize Sales and Marketing Strategies",
      "Marketing Mix Optimization via Linear Programming: A Case Study",
      "An Operation Research Approach to Pricing and Advertising Strategies in a Duopoly Market"
    ]
  },
  {
    "title": "Database and storage security: Information accountability and usage control",
    "gen_list": [
      "<TITLE>A Survey on Database Security Threats and Countermeasures</TITLE>",
      "<TITLE>Database Security: A Comprehensive Review of the State-of-the-Art</TITLE>",
      "<TITLE>Information Accountability and Usage Control in Databases</TITLE>",
      "<TITLE>Security in Database Systems: Threats, Attacks, and Countermeasures</TITLE>",
      "<TITLE>A Framework for Database Security and Privacy</TITLE>"
    ]
  },
  {
    "title": "Systems security: Firewalls",
    "gen_list": [
      "Firewalls: The Definitive Guide",
      "Security in Computing: Firewalls and Network Security",
      "Firewall Security: Protecting Your Network from Cyber Threats",
      "Firewall Hacks: 101 Things to Do with Your Firewall",
      "Firewall Configuration and Management: A Practical Approach"
    ]
  },
  {
    "title": "Embedded and cyber-physical systems: Sensor networks",
    "gen_list": [
      "Sensor Networks: A Survey of Recent Advances and Challenges",
      "Cyber-Physical Systems: The Next Generation of Embedded Systems",
      "Embedded Systems for Sensor Networks: A Review of the State of the Art",
      "Sensor Networks and Cyber-Physical Systems: Opportunities and Challenges",
      "The Future of Embedded and Cyber-Physical Systems: Trends, Challenges, and Opportunities"
    ]
  },
  {
    "title": "Randomness, geometry and discrete structures: Random network models",
    "gen_list": [
      "\"Random Networks\" by Mark Newman",
      "\"Discrete Geometric Random Walks\" by Peter M. Griefer",
      "\"Random Structures in Discrete Mathematics\" by Ladislav Kovrizhin",
      "\"Geometry and Randomness in Networks\" by Jure Leskovec",
      "\"Discrete Geometric Methods for Random Networks\" by Timo Oeteringen"
    ]
  },
  {
    "title": "Accessibility: Accessibility design and evaluation methods",
    "gen_list": [
      "Accessibility Design and Evaluation Methods: A Review",
      "Designing for Accessibility: A Practical Guide",
      "Accessibility Evaluation Methods: A Comparative Study",
      "Accessibility in User Experience: A Systematic Review",
      "Evaluating the Accessibility of Digital Products: A Framework and Toolkit"
    ]
  },
  {
    "title": "Randomness, geometry and discrete structures: Generating random combinatorial structures",
    "gen_list": [
      "Combinatorial Random Graphs",
      "Random Geometry and Discrete Structures",
      "Random Walks on Combinatorial Objects",
      "Discrete Random Structures: Generating and Analyzing",
      "Geometric Random Graphs and Networks"
    ]
  },
  {
    "title": "Network protocols: Application layer protocols",
    "gen_list": [
      "Application Layer Protocols in Computer Networks",
      "Layered Communication and Network Protocols",
      "Application-Specific Network Protocols: A Survey",
      "Network Application Protocols for Distributed Systems",
      "A Survey of Application Layer Protocols in Wireless Sensor Networks"
    ]
  },
  {
    "title": "Computing / technology policy: Government technology policy",
    "gen_list": [
      "Government Technology Policy: A Review of the Literature",
      "The Role of Government in Shaping Technological Innovation",
      "Technology Policy and Governance: The Case of the Digital Single Market",
      "Government's Impact on the Development and Deployment of Emerging Technologies",
      "<TITLE>The Future of Technology Policy: Trends, Challenges, and Opportunities</TITLE>"
    ]
  },
  {
    "title": "Electronic design automation: Timing analysis",
    "gen_list": [
      "\"Timing Analysis for Digital Systems\" by M. T. Mehrotra and R. K. Gupta",
      "\"A Survey on Timing Analysis Techniques in Electronic Design Automation\" by S. K. Chauhan and P. Kumar",
      "\"Timing Closure Methodologies for VLSI Design\" by A. M. Keller and J. D. O'Brien",
      "\"A Framework for Timing Analysis in the Presence of Uncertainty\" by S. J. Mason and R. E. Levin",
      "\"Timing Analysis in the Context of Clock Skew and Network Delays\" by A. H. Agrawal and A. K. Singh"
    ]
  },
  {
    "title": "Emerging technologies: Quantum technologies",
    "gen_list": [
      "Quantum Computing: A New Era of Computation",
      "The Future of Quantum Technologies",
      "Quantum Information Processing and Quantum Cryptography",
      "Emerging Technologies for Quantum Communication Networks",
      "Quantum Technology: Opportunities and Challenges"
    ]
  },
  {
    "title": "Modeling and simulation: Model development and analysis",
    "gen_list": [
      "A Framework for Simulating and Analyzing the Performance of Cloud Computing Systems",
      "Modeling and Simulation of Supply Chain Networks: A Survey",
      "Development and Application of a Discrete Event Simulation Model for Hospital Emergency Departments",
      "A Hybrid Modeling Approach to Analyze the Performance of Large-Scale Distributed Systems",
      "Simulation-Based Optimization of Production Systems: A Survey and Future Directions"
    ]
  },
  {
    "title": "Document management and text processing: Document capture",
    "gen_list": [
      "A Survey on Document Capture Technologies for Electronic Document Management",
      "Document Capture: A Review of Techniques and Applications",
      "Image-Based Document Capture and Processing: A Study on Optical Character Recognition and Text Recognition",
      "A Comprehensive Review of Document Management and Text Processing Techniques",
      "Document Capture and Processing: Challenges and Opportunities in the Digital Age"
    ]
  },
  {
    "title": "Network types: Ad hoc networks",
    "gen_list": [
      "Ad Hoc Networks: A Survey",
      "Network Types: Ad Hoc Networks vs. Traditional Networks",
      "Ad Hoc Networks: Characteristics and Applications",
      "The Differences Between Ad Hoc and Fixed Networks",
      "Ad Hoc Networks: Design and Implementation Challenges"
    ]
  },
  {
    "title": "Continuous mathematics: Continuous functions",
    "gen_list": [
      "Introduction to Mathematical Thinking",
      "Continuous Functions and Their Properties",
      "The Real Numbers and Their Applications",
      "Calculus on the Real Line",
      "Advanced Calculus: A Modern Perspective"
    ]
  },
  {
    "title": "Emerging technologies: Circuit substrates",
    "gen_list": [
      "Advances in Emerging Technologies for Circuit Substrates",
      "Emerging Materials and Technologies for High-Performance Circuit Substrates",
      "Circuit Substrate Technology: A Review of the Latest Developments and Future Trends",
      "Substrate Technologies for Emerging Applications in Electronics",
      "Emerging Platforms for Circuit Substrates: Opportunities and Challenges"
    ]
  },
  {
    "title": "Real-time systems: Real-time languages",
    "gen_list": [
      "Real-Time Programming",
      "Real-Time Language Design",
      "Designing and Building Real-Time Systems",
      "Real-Time Systems: A Survey of the Field",
      "Theory and Practice of Real-Time Programming"
    ]
  },
  {
    "title": "Information systems applications: Mobile information processing systems",
    "gen_list": [
      "Designing and Implementing Mobile Information Processing Systems",
      "Mobile Information Processing Systems: A Survey of Recent Trends and Applications",
      "The Impact of Mobile Information Processing Systems on Business Operations",
      "Mobile Information Processing Systems: Challenges and Opportunities in the Digital Age",
      "The Role of Mobile Information Processing Systems in Enhancing Organizational Productivity"
    ]
  },
  {
    "title": "Formal languages and automata theory: Automata over infinite objects",
    "gen_list": [
      "Introduction to Formal Languages and Automata",
      "Concepts of Computation: Theory and Models",
      "Formal Language Theory and Applications",
      "Theory of Computation: A Modern Approach",
      "Automata on Infinite Objects: A Survey"
    ]
  },
  {
    "title": "Communication hardware, interfaces and storage: External storage",
    "gen_list": [
      "<TITLE>The Design and Implementation of a High-Performance Storage System for Scientific Applications</TITLE>",
      "<TITLE>A Survey of External Storage Systems for Big Data</TITLE>",
      "<TITLE>External Storage Solutions for Cloud Computing</TITLE>",
      "<TITLE>Storage Area Networks: A Comprehensive Review</TITLE>",
      "<TITLE>A Comparative Study of External Storage Systems for Data Centers</TITLE>"
    ]
  },
  {
    "title": "Artificial intelligence: Computer vision",
    "gen_list": [
      "Deep Learning for Computer Vision",
      "Convolutional Neural Networks for Image Recognition",
      "A Survey on Deep Learning for Image Classification",
      "Object Detection and Recognition in Convolutional Neural Networks",
      "Deep Learning for Visual Object Detection"
    ]
  },
  {
    "title": "Network services: Network management",
    "gen_list": [
      "Network Management: A Survey of Current Trends and Future Directions",
      "Network Service Management: A Comprehensive Review",
      "Network Operations and Management: A Practical Approach",
      "Network Management Systems: Architecture, Design, and Implementation",
      "Future of Network Management: Emerging Technologies and Trends"
    ]
  },
  {
    "title": "Power and energy: Thermal issues",
    "gen_list": [
      "\"Thermal Energy Storage for Power Systems\" by J. M. Martin and R. E. Sherman",
      "\"Thermal Management of Electronic Equipment: A Review\" by S. K. Sahu and S. C. Lee",
      "\"Power Generation from Waste Heat: A Review\" by M. M. Khurana and A. K. Bhardwaj",
      "\"Thermal Energy Harvesting: A Review of Technologies and Applications\" by T. F. H. Liao and C. Y. Chang",
      "\"Power Generation using Solar Thermal Systems: A Review\" by S. R. Kulkarni and S. B. Jain"
    ]
  },
  {
    "title": "Electronic design automation: Hardware description languages and compilation",
    "gen_list": [
      "Hardware Description Languages: A Survey",
      "Compilation of Hardware Description Languages",
      "Electronic Design Automation: A Comprehensive Introduction",
      "Hardware Compilation: Techniques and Tools",
      "Design Automation for Digital Integrated Circuits"
    ]
  },
  {
    "title": "Cross-computing tools and techniques: Measurement",
    "gen_list": [
      "A Survey of Cross-Computing Techniques and Tools",
      "Cross-Computing: A Comprehensive Review of Techniques and Tools",
      "Measuring the Performance of Cross-Computing Systems: A Survey",
      "A Framework for Evaluating Cross-Computing Tools and Techniques",
      "Cross-Computing: Challenges and Opportunities in Measurement and Evaluation"
    ]
  },
  {
    "title": "Physical sciences and engineering: Electronics",
    "gen_list": [
      "Fundamentals of Electric Circuits",
      "Introduction to Electromagnetism",
      "Physics for Scientists and Engineers",
      "Electronic Devices and Circuit Theory",
      "Signal Processing: A Practical Approach"
    ]
  },
  {
    "title": "Network protocols: Session protocols",
    "gen_list": [
      "\"Session Initiation Protocol (SIP)\".",
      "\"Real-time Transport Protocol (RTP)\".",
      "\"User Datagram Protocol (UDP)\".",
      "\"Socket Programming\".",
      "\"Transmission Control Protocol (TCP)\"."
    ]
  },
  {
    "title": "Arts and humanities: Media arts",
    "gen_list": [
      "The Oxford Handbook of New Media and Contemporary Art",
      "Media Art Histories: Approaches, Applications, and Implications",
      "The Routledge Companion to Media Art",
      "Art and Media: A Materialist Theory",
      "Digital Media and the Future of Art"
    ]
  },
  {
    "title": "Education: Distance learning",
    "gen_list": [
      "The Future of Education: How Technology Can Transform the Way We Learn",
      "Online Learning: A Guide to Distance and E-Learning",
      "Distance Learning: A Handbook for Students, Teachers, and Administrators",
      "Blended Learning: Global Perspectives, Local Solutions",
      "Open Educational Resources: Making Education More Accessible and Inclusive"
    ]
  },
  {
    "title": "Systems security: File system security",
    "gen_list": [
      "\"File System Security: A Survey\" by Ahmed et al.",
      "\"File System Security: Threats, Challenges, and Solutions\" by Jain et al.",
      "\"Securing the File System: A Practical Guide\" by Sadeghi et al.",
      "\"File System Security: A Comprehensive Review\" by Patel et al.",
      "\"Protecting the File System: Techniques and Tools\" by Dhar et al."
    ]
  },
  {
    "title": "Human computer interaction (HCI): Interactive systems and tools",
    "gen_list": [
      "The Design of Everyday Things: A Root & Branch Approach to Interaction Design",
      "Human-Computer Interaction: Fusion of Theory and Practice",
      "Interaction Design: Beyond Human-Computer Interaction",
      "Handbook of Human-Centred Software Engineering",
      "The Psychology of Goal-Directed Behavior: Introduction to Cognitive, Affective, and Social Processes"
    ]
  },
  {
    "title": "Formal methods and theory of security: Trust frameworks",
    "gen_list": [
      "<TITLE>A Framework for Evaluating Security Trustworthiness</TITLE>",
      "<TITLE>Trust in Distributed Systems: A Formal Analysis</TITLE>",
      "<TITLE>Formal Methods for Secure System Design and Verification</TITLE>",
      "<TITLE>Security Trust Models: A Comprehensive Survey</TITLE>",
      "<TITLE>A Formal Framework for Security Trust Management</TITLE>"
    ]
  },
  {
    "title": "Communication hardware, interfaces and storage: Scanners",
    "gen_list": [
      "\"Scanner Technology and Applications\" by S. K. Chang",
      "\"Computer Hardware and Maintenance\" by J. M. Chang",
      "\"Input Devices: Scanners, Joysticks, and Tablets\" by R. A. Kemper",
      "\"Scanning and Imaging: Theories, Methods, and Applications\" by T. A. Lowe",
      "\"Digital Image Acquisition and Processing\" by J. F. P. Correia"
    ]
  },
  {
    "title": "Professional topics: Management of computing and information systems",
    "gen_list": [
      "Managing IT Projects: A Guide for Business Managers",
      "Information Systems Management: Strategy, Implementation and Practice",
      "Computer Security Management: Protecting Information Systems from Threats",
      "Enterprise Risk Management: From Inherent Uncertainty to Strategic Decision",
      "Managing the Digital Firm: How Technology is Reshaping Business, Work and Life"
    ]
  },
  {
    "title": "Information theory: Coding theory",
    "gen_list": [
      "Coding Theory for Data Storage and Communication",
      "Introduction to Information Theory",
      "Coding and Information Theory",
      "Fundamentals of Coding Theory"
    ]
  },
  {
    "title": "Information storage systems: Record storage systems",
    "gen_list": [
      "Record Storage Systems: A Survey",
      "Design and Implementation of a Record Storage System",
      "A Comparative Study of Record Storage Systems",
      "Record Storage Systems: Challenges and Opportunities",
      "Future Directions in Record Storage Systems Research"
    ]
  },
  {
    "title": "Information retrieval: Information retrieval query processing",
    "gen_list": [
      "A Survey on Query Processing Techniques in Information Retrieval",
      "Query Processing in Information Retrieval: A Review",
      "Information Retrieval Query Processing: A Machine Learning Approach",
      "Query Processing for Information Retrieval: Challenges and Opportunities",
      "A Framework for Evaluating Query Processing Techniques in Information Retrieval"
    ]
  },
  {
    "title": "Enterprise computing: Enterprise modeling",
    "gen_list": [
      "Enterprise Modeling: A Practical Guide",
      "Enterprise Computing: Concepts, Methodologies, Tools, and Applications",
      "Enterprise Modeling Language: A Notation for Enterprise Systems",
      "Enterprise Architecture: Planning and Practice",
      "Model-Driven Engineering: A Survey of Approaches, Tools, and Challenges"
    ]
  },
  {
    "title": "Law, social and behavioral sciences: Economics",
    "gen_list": [
      "The Economic Analysis of Law",
      "Behavioral Law and Economics",
      "Law and Economics: A Critical Review",
      "The Social Impact of Legal Change",
      "Economic Perspectives on Legal Systems"
    ]
  },
  {
    "title": "Probability and statistics: Statistical paradigms",
    "gen_list": [
      "Foundations of Probability Theory",
      "Statistical Inference: A Review of the Literature",
      "A Guide to Probability and Statistics",
      "Probability and Statistics for Dummies",
      "Statistics in Plain English"
    ]
  },
  {
    "title": "Design and analysis of algorithms: Concurrent algorithms",
    "gen_list": [
      "Introduction to Concurrent Programming",
      "Parallel Processing and Concurrency",
      "Algorithm Design Techniques for Concurrent Systems",
      "Distributed Computing and Middleware",
      "Verification and Validation of Concurrent Algorithms"
    ]
  },
  {
    "title": "Machine learning: Learning settings",
    "gen_list": [
      "Machine Learning Settings: A Survey",
      "Learning Settings in Machine Learning: A Critical Review",
      "Machine Learning Setting: A Comprehensive Overview",
      "The Impact of Machine Learning Settings on Model Performance",
      "Machine Learning Setting Optimization: A New Approach"
    ]
  },
  {
    "title": "Logic: Equational logic and rewriting",
    "gen_list": [
      "Equational Logic and Rewriting",
      "Logic for Programmers: A Gentle Introduction",
      "Rewriting Systems and Their Applications",
      "Equational Reasoning in Computer Science",
      "Logical and Computational Aspects of Rewriting"
    ]
  },
  {
    "title": "Communication hardware, interfaces and storage: Printers",
    "gen_list": [
      "Printer Technology: An Overview",
      "Printer Interfaces: Parallel, Serial, and USB",
      "Printer Storage: Inkjet and Laser Printers",
      "Printer Connectivity: Wired and Wireless Options",
      "Printer Security: Protecting Your Print Environment"
    ]
  },
  {
    "title": "Electronic commerce: Online banking",
    "gen_list": [
      "Online Banking: A Review of the Literature",
      "Electronic Commerce and Online Banking: A Study on User Behavior",
      "The Impact of Electronic Commerce on Traditional Banking",
      "Online Banking Services: A Survey of Customer Satisfaction",
      "E-Banking: The Future of Banking?"
    ]
  },
  {
    "title": "Mathematical analysis: Integral equations",
    "gen_list": [
      "Integral Equations and Their Applications",
      "Solving Integral Equations: A Comprehensive Introduction",
      "Mathematical Methods for Solving Integral Equations",
      "Numerical Solution of Integral Equations",
      "Advances in Integral Equation Theory and Applications"
    ]
  },
  {
    "title": "Cross-computing tools and techniques: Design",
    "gen_list": [
      "Designing Cross-Computing Systems: A Survey",
      "Cross-Computing Technologies and Tools for Grid Computing",
      "A Framework for Cross-Computing in Distributed Systems",
      "Cross-Computing in Cloud Computing: A Review",
      "Designing Cross-Computing Applications: A Taxonomy and Case Studies"
    ]
  },
  {
    "title": "Communication hardware, interfaces and storage: Wireless integrated network sensors",
    "gen_list": [
      "Design and Development of a Wireless Integrated Network Sensor for Monitoring Environmental Pollutants",
      "Wireless Sensor Networks: A Survey of Communication Hardware, Interfaces, and Storage Options",
      "A Comprehensive Review of Wireless Integrated Network Sensors for Healthcare Applications",
      "Wireless Integrated Network Sensors for Disaster Response and Management: A Systematic Review",
      "A Survey on Communication Hardware, Interfaces, and Storage in Wireless Integrated Network Sensors for Smart Cities"
    ]
  },
  {
    "title": "Machine learning: Machine learning approaches",
    "gen_list": [
      "A Survey on Deep Learning for Computer Vision",
      "Machine Learning Approaches for Predicting Drug Side Effects",
      "A Comprehensive Review of Machine Learning Techniques for Text Classification",
      "Machine Learning for Healthcare: A Survey of Applications and Challenges",
      "A Comparative Study of Supervised Learning Algorithms for Image Recognition"
    ]
  },
  {
    "title": "Dependable and fault-tolerant systems and networks: Availability",
    "gen_list": [
      "Availability in Dependable Systems",
      "Fault Tolerance and Repairability in Distributed Systems",
      "A Framework for Evaluating the Availability of Distributed Systems",
      "Availability Management: A Key to High-Performance Networks",
      "Fault Tolerance and Failure Modeling in Dependable Systems"
    ]
  },
  {
    "title": "Software notations and tools: Software maintenance tools",
    "gen_list": [
      "A Framework for Software Maintenance Notations",
      "Software Maintenance: Tools and Techniques",
      "Notation-Based Software Maintenance: A Survey",
      "Tools and Techniques for Software Maintenance",
      "Software Maintenance: A Comprehensive Review of Notations and Tools"
    ]
  },
  {
    "title": "Dependable and fault-tolerant systems and networks: Redundancy",
    "gen_list": [
      "Redundancy in Networks",
      "Fault Tolerance in Distributed Systems",
      "Dependable and Fault-Tolerant Systems: A Survey",
      "Network Redundancy and Replication",
      "Reliability and Fault Tolerance in Computer Networks"
    ]
  },
  {
    "title": "Information systems applications: Multimedia information systems",
    "gen_list": [
      "Designing Multimedia Information Systems: A Guide to Planning, Implementation, and Evaluation",
      "Multimedia Information Systems: Concepts, Design, and Applications",
      "Information Systems Applications in Multimedia Environments",
      "Multmedia Information Systems: A Framework for Analysis and Design",
      "Applications of Information Systems in Multimedia Environments"
    ]
  },
  {
    "title": "Hardware test: Board- and system-level test",
    "gen_list": [
      "Hardware Testing for Embedded Systems",
      "Board-Level Testing: A Comprehensive Guide",
      "System-Level Testing: Ensuring Quality and Reliability",
      "The Art of Hardware Testing: Techniques, Tools, and Best Practices",
      "Hardware Testing in the Age of Complexity: Challenges and Solutions"
    ]
  },
  {
    "title": "Communication hardware, interfaces and storage: Sensors and actuators",
    "gen_list": [
      "Sensor and Actuator Technologies for Communication Systems",
      "Communication Hardware, Interfaces, and Storage: A Survey",
      "Sensors and Actuators in Communication Networks",
      "Communication Hardware and Software: Sensors, Actuators, and Interfaces",
      "Storage and Retrieval of Data in Communication Systems Using Sensors and Actuators"
    ]
  },
  {
    "title": "Human computer interaction (HCI): Interaction techniques",
    "gen_list": [
      "\"Human-Computer Interaction: Fundamentals, Theory, and Practice\" by J. Jacko and M. A. Mark.",
      "\"Interaction Techniques: Beyond Buttons and Menus\" by D. H. Shneiderman.",
      "\"Human-Computer Interaction: A Designer's Guide to People, Practices, and Tools\" by J. M. Carroll.",
      "\"Interactive System Design: Theories and Practices of Human-Computer Interaction\" by M. K. Dunn and S. E. Robertson.",
      "\"The Elements of User Experience: A Guide to Finding, Designing, and Building Usable Products\" by J. M. Molander."
    ]
  },
  {
    "title": "Computer forensics: Surveillance mechanisms",
    "gen_list": [
      "A Survey of Computer Forensic Tools and Techniques",
      "Computer Forensics: A Practical Approach",
      "Forensic Analysis of Computers and Digital Devices",
      "Computer Forensics: Surveillance Mechanisms and Techniques",
      "Advanced Computer Forensics and Investigations"
    ]
  },
  {
    "title": "Discrete mathematics: Graph theory",
    "gen_list": [
      "\"Graph Theory\" by Reinhard Diestel",
      "\"Introduction to Graph Theory\" by Michael T. Hendrickson",
      "\"Graph Theory: A Contemporary Approach\" by Richard C. Gonzalez and Joseph R. Kohn",
      "\"Discrete Mathematics and Its Applications\" by Kenneth H. Rosen",
      "\"Graph Theory: An Introduction\" by Peter J. Eccles"
    ]
  },
  {
    "title": "Physical sciences and engineering: Archaeology",
    "gen_list": [
      "The Archaeology of Ancient Egypt",
      "Physics of the Past: How the Ancient Greeks Viewed Their World",
      "Archaeoengineering: The application of engineering principles to archaeological research and preservation",
      "The Archaeology of Industrialization: Material Culture and the Birth of the Modern World",
      "Experimental Archaeology: Reconstructing the Past through Direct Experience"
    ]
  },
  {
    "title": "Cross-computing tools and techniques: Experimentation",
    "gen_list": [
      "Experiments in Cross-Computing: A Survey of Techniques and Tools",
      "Cross-Computing: A Comprehensive Review of Techniques, Tools, and Applications",
      "Designing and Experimenting with Cross-Computing Systems",
      "Evaluating the Performance of Cross-Computing Tools and Techniques through Experimental Studies",
      "Approaches to Cross-Computing: An Experimental Study of Different Paradigms and Technologies"
    ]
  },
  {
    "title": "Intrusion/anomaly detection and malware mitigation: Social engineering attacks",
    "gen_list": [
      "Social Engineering Attacks: A Threat to Intrusion Detection Systems",
      "Detecting Social Engineered Malware in Network Traffic",
      "Anomaly Detection for Social Engineering Attacks Using Machine Learning Techniques",
      "Social Engineering Defenses: A Survey of Current Approaches and Challenges",
      "Detecting and Mitigating Social Engineering Attacks in Cloud Environments"
    ]
  },
  {
    "title": "Dependable and fault-tolerant systems and networks: Maintainability and maintenance",
    "gen_list": [
      "Maintaining Dependable Systems: A Maintenance Management Approach",
      "Fault-Tolerant Systems and Networks: Design, Analysis, and Testing",
      "Maintenance and Reliability Engineering: A Practical Guide",
      "Dependable Systems and Networks: Theory, Tools, and Applications",
      "Maintaining Complex Systems: Challenges and Strategies for the 21st Century"
    ]
  },
  {
    "title": "Physical sciences and engineering: Earth and atmospheric sciences",
    "gen_list": [
      "Geoscience and Engineering: An Introduction",
      "Atmospheric Science: A Very Short Introduction",
      "Earth Sciences: An Introduction",
      "Physics of the Earth and Planetary Sciences",
      "The Earth's Atmosphere: Its Physics and Dynamics"
    ]
  },
  {
    "title": "Models of computation: Concurrency",
    "gen_list": [
      "Concurrency and Computation: A Model Theoretic Approach",
      "Formal Models of Concurrency",
      "A Theory of Concurrency",
      "Concurrency: A Logical Introduction",
      "The Theory of Concurrency and Parallelism"
    ]
  },
  {
    "title": "Systems security: Distributed systems security",
    "gen_list": [
      "<TITLE>Securing Distributed Systems: A Survey of Techniques and Challenges</TITLE>",
      "<TITLE>Distributed Systems Security: A Comprehensive Review</TITLE>",
      "<TITLE>Security in Distributed Systems: Threats, Vulnerabilities, and Solutions</TITLE>",
      "<TITLE>Deterring Attacks on Distributed Systems</TITLE>",
      "<TITLE>Practical Security for Distributed Systems: A Holistic Approach</TITLE>"
    ]
  },
  {
    "title": "Life and medical sciences: Metabolomics / metabonomics",
    "gen_list": [
      "A comprehensive review of metabolomics in life sciences",
      "Metabolomics in drug discovery and development",
      "The application of metabonomics to personalized medicine",
      "Metabolomics in the study of complex diseases",
      "The future of metabolomics in life sciences research"
    ]
  },
  {
    "title": "Software creation and management: Designing software",
    "gen_list": [
      "Designing Software for Ease of Use",
      "Software Design Patterns: Best Practices and Case Studies",
      "Agile Software Development: Creating Innovative Products",
      "User-Centered Design for Software: A Guide to Creating User-Friendly Systems",
      "Software Architecture: Patterns, Principles, and Practices"
    ]
  },
  {
    "title": "Computers in other domains: Cartography",
    "gen_list": [
      "Computational Cartography: A Survey of Recent Advances and Challenges",
      "Geographic Information Systems (GIS) and Computer Cartography: An Overview",
      "The Role of Computers in Modern Cartography: A Critical Review",
      "Computer-Aided Cartography: A Survey of Techniques and Applications",
      "Cartography in the Digital Age: The Impact of Computers on Mapmaking"
    ]
  },
  {
    "title": "Very large scale integration design: Economics of chip design and manufacturing",
    "gen_list": [
      "A Framework for Very Large Scale Integration (VLSI) Design",
      "Economics of Chip Design and Manufacturing: A Survey",
      "Very Large Scale Integration: Design, Testing, and Reliability",
      "Design for Manufacturability and Economics in VLSI Systems",
      "VLSI System Design: Economic and Technology Considerations"
    ]
  },
  {
    "title": "Professional topics: Computing industry",
    "gen_list": [
      "The Future of Work in the Computing Industry",
      "Trends and Challenges in the Global Computing Market",
      "The Impact of Automation on the Computing Industry",
      "Cybersecurity Threats and Vulnerabilities in the Computing Industry",
      "The Role of AI in Shaping the Future of Computing"
    ]
  },
  {
    "title": "Software organization and properties: Software system structures",
    "gen_list": [
      "Software Architecture: A Comprehensive Guide",
      "Software System Structure and Organization",
      "Software Engineering: A Practitioner's Approach",
      "Software Design Patterns: Blueprints for Reusable Object-Oriented Software",
      "The Art of Readable Code: A Guide to Crafting High-Quality Code"
    ]
  },
  {
    "title": "Life and medical sciences: Bioinformatics",
    "gen_list": [
      "Bioinformatics: A Comprehensive Review",
      "Bioinformatics and Personalized Medicine",
      "Informational Biology: The Intersection of Life Sciences and Computer Science",
      "Bioinformatics and Systems Biology: A New Era for Life Sciences Research"
    ]
  },
  {
    "title": "Embedded and cyber-physical systems: Embedded systems",
    "gen_list": [
      "Embedded Systems: A Contemporary Design Tool",
      "Cyber-Physical Systems: Principles and Challenges",
      "Designing Embedded Systems: A Holistic Approach",
      "The Future of Embedged Systems: Trends, Challenges, and Opportunities",
      "Cyber-Physical Systems: From Theory to Practice"
    ]
  },
  {
    "title": "Embedded and cyber-physical systems: Sensors and actuators",
    "gen_list": [
      "\"Sensor Networks for Embedded and Cyber-Physical Systems\" by S. S. Ranka and J. M. Dongarra",
      "\"Actuators in Embedded and Cyber-Physical Systems: A Survey\" by A. M. A. Rahman and M. A. Karim",
      "\"Sensors and Actuators for Embedded and Cyber-Physical Systems\" by J. Liu and H. Qi",
      "\"Embedded Systems and Cyber-Physical Systems: A Survey of Sensors and Actuators\" by M. R. H. Mandic and F. F. B. M. Soares",
      "\"Sensing and Actuation in Embedded and Cyber-Physical Systems: Challenges and Opportunities\" by J. Liu, et al."
    ]
  },
  {
    "title": "Very large scale integration design: Standard cell libraries",
    "gen_list": [
      "\"Design and Implementation of a Very Large-Scale Integration (VLSI) Standard Cell Library\" by S. S. Ranka et al.",
      "\"A Framework for the Design of Very Large-Scale Integration (VLSI) Standard Cells\" by A. K. Jain et al.",
      "\"Design of a High-Performance Very Large-Scale Integration (VLSI) Standard Cell Library\" by S. K. Singh et al.",
      "\"A Survey on Very Large-Scale Integration (VLSI) Standard Cell Libraries and Their Applications\" by M. A. Bhuiyan et al.",
      "\"Design and Optimization of a VLSI Standard Cell Library for Digital Systems\" by S. K. Goyal et al."
    ]
  }
]